# Integrating Pythonn and SQL

## Step-01 Install the required libraries

In [1]:
pip install pymysql

Collecting pymysqlNote: you may need to restart the kernel to use updated packages.

  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/45.0 kB ? eta -:--:--
   ------------------ --------------------- 20.5/45.0 kB 330.3 kB/s eta 0:00:01
   ------------------ --------------------- 20.5/45.0 kB 330.3 kB/s eta 0:00:01
   ---------------------------------------- 45.0/45.0 kB 246.3 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

## Step-02 Import required libraries

In [2]:
import pymysql
import pandas as pd

In [4]:
connection = pymysql.connect(
    host = 'localhost', # replace with your host
    user = 'root', # replace with your username
    password = '#6han', # replace with your password
    database = 'sql_exercises' # replace with your database 
)

cursor = connection.cursor()

## Step-03 Execute Queries and Fetch Data

In [7]:
# Select all records from the employee table
select_query = 'select employee_id, emp_name, email, national_identity_number, salary, department_id, hire_year from employee'
cursor.execute(select_query)
rows = cursor.fetchall()

df = pd.DataFrame(rows,columns=['employee_id', 'emp_name', 'email', 'national_identity_number', 'salary', 'department_id', 'hire_year'])
df.head()

,employee_id,emp_name,email,national_identity_number,salary,department_id,hire_year
0,101,abc,23khan,12,30293,25,2000
1,102,akil,202331365.akil@ug.sharda.ac.in,13,35400,24,1995

## Step 4: Automate ETL Processes
* Here's a simple ETL (Extract, Transform, Load) example:

    * Extract data from the database
    * Transform the data (e.g., increase salaries by 10%)
    * Load the data back into the database (update salaries)

In [10]:
# Extract data
extract_query = 'SELECT employee_id, salary FROM employee'
cursor.execute(extract_query)
employees = cursor.fetchall()

# Transform data (increase salary by 10%)
updated_salaries = [(salary * 1.10, emp_id) for emp_id, salary in employees]

# Load data (update salaries in the database)
update_query = 'UPDATE employee SET salary = %s WHERE employee_id = %s'
cursor.executemany(update_query, updated_salaries)

# Commit the changes
# connection.commit()

# Verify the update
cursor.execute(select_query)
rows = cursor.fetchall()

# Convert to a DataFrame for better readability
df = pd.DataFrame(rows,columns=['employee_id', 'emp_name', 'email', 'national_identity_number', 'salary', 'department_id', 'hire_year'])
df.head()

,employee_id,emp_name,email,national_identity_number,salary,department_id,hire_year
0,101,abc,23khan,12,36654,25,2000
1,102,akil,202331365.akil@ug.sharda.ac.in,13,42834,24,1995

# 5/02/2025 Thursday